## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.terraform-azure-collection.azurerm_storage_account.observe_storage_account_secured will be updated in-place
  ~ resource "azurerm_storage_account" "observe_storage_account_secured" {
        id                                 = "/subscriptions/080291cf-8419-427c-953c-944e6c351029/resourceGroups/gh-rg-nikhil-flex-plan-pvt-endpoint/providers/Microsoft.Storage/storageAccounts/179969258044cusecured"
        name                               = "179969258044cusecured"
      ~ public_network_access_enabled      = false -> true
        tags                               = {}
        # (96 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.terraform-azure-collection.azurerm_storage_share.observe_storage_account_secured_share will be created
  + resource "azurerm_storage_share" "observe_storage_account_secured_share" {
      + access_tier          = (known after apply)
      + enabled_protocol     = "SMB"
      + id                   = (known after apply)
      + metadata             = (known after apply)
      + name                 = "gh-fa-nikhil-flex-plan-pvt-endpoint-aea2"
      + quota                = 102400
      + resource_manager_id  = (known after apply)
      + storage_account_name = "179969258044cusecured"
      + url                  = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```
</details>